[
  {
    "QuestionId": "WebQTrn-2393",
    "RawQuestion": "who started google?",
    "ProcessedQuestion": "who started google",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0387r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0387r ns:law.invention.inventor ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0gjpq",
            "EntityName": "Larry Page"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0gjq6",
            "EntityName": "Sergey Brin"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2405",
    "RawQuestion": "what is colorado's state flower?",
    "ProcessedQuestion": "what is colorado 's state flower",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n4w ns:government.governmental_jurisdiction.official_symbols ?y .\n?y ns:location.location_symbol_relationship.symbol ?x .\n?y ns:location.location_symbol_relationship.Kind_of_symbol ns:m.04627gn .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.069d4f",
            "EntityName": "Aquilegia caerulea"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2408",
    "RawQuestion": "which jane austen books are movies?",
    "ProcessedQuestion": "which jane austen books are movies",
    "Parses": [
      {
        "Sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\t?x ns:common.topic.notable_types ns:m.0jsg2m .\n        ?x ns:film.film.story_by ns:m.040dv .\n}",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.011yg9",
            "EntityName": "Sense and Sensibility"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02q8r2w",
            "EntityName": "Northanger Abbey"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02q8r4y",
            "EntityName": "Persuasion"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.072zl1",
            "EntityName": "Pride & Prejudice"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07tj4c",
            "EntityName": "Emma"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07v8_d",
            "EntityName": "Pride and Prejudice"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07v95y",
            "EntityName": "Pride and Prejudice: A Latter-Day Comedy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.08m1s2",
            "EntityName": "Becoming Jane"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09ncpg",
            "EntityName": "Northanger Abbey"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09rnxj",
            "EntityName": "Persuasion"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0f98p_",
            "EntityName": "Jane Austen in Manhattan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0fsd9t",
            "EntityName": "Mansfield Park"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0qjzd",
            "EntityName": "Clueless"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2410",
    "RawQuestion": "where is lanzarote in a world map?",
    "ProcessedQuestion": "where is lanzarote in a world map",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s8wm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s8wm ns:geography.island.island_group ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0hzjwx2",
            "EntityName": "Canary Islands"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2420",
    "RawQuestion": "where do islamic people go to worship?",
    "ProcessedQuestion": "where do islamic people go to worship",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0flw86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0flw86 ns:religion.religion.types_of_places_of_worship ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04_xn",
            "EntityName": "Mosque"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0pc5qwj",
            "EntityName": "Masjid Hamza, Valley Stream"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2423",
    "RawQuestion": "what god does taoism believe in?",
    "ProcessedQuestion": "what god does taoism believe in",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gvx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gvx ns:religion.religion.deities ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01g7jh",
            "EntityName": "He Xiangu"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01g7kl",
            "EntityName": "Cao Guojiu"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01g7ln",
            "EntityName": "Li Tieguai"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01g7m0",
            "EntityName": "Lan Caihe"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01g7rf",
            "EntityName": "Lü Dongbin"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01gcpc",
            "EntityName": "Han Xiangzi"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01gcpr",
            "EntityName": "Zhang Guolao"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01gcqh",
            "EntityName": "Zhongli Quan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01tbmq",
            "EntityName": "Jade Emperor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0258q8",
            "EntityName": "Queen Mother of the West"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.025964",
            "EntityName": "Three Pure Ones"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02rj87h",
            "EntityName": "Magu"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09n_d1",
            "EntityName": "Yuanshi Tianzun"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0j626gb",
            "EntityName": "Cai Shen"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2431",
    "RawQuestion": "what year did george washington become the president?",
    "ProcessedQuestion": "what year did george washington become the president",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034rd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034rd ns:government.politician.government_positions_held ?y .\n?y ns:government.government_position_held.from ?x .\n?y ns:government.government_position_held.basic_title ns:m.060c4 .\n}\n",
        "Answers": [
          {
            "AnswerType": "Value",
            "AnswerArgument": "1789-04-30",
            "EntityName": null
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2436",
    "RawQuestion": "on which river is paris?",
    "ProcessedQuestion": "on which river is paris",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qtj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qtj ns:location.location.partially_contains ?x .\n?x ns:common.topic.notable_types ns:m.01xs05k .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0f3vz",
            "EntityName": "Seine"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2438",
    "RawQuestion": "who is sherri shepherd's new husband?",
    "ProcessedQuestion": "who is sherri shepherd 's new husband",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c33pl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c33pl ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?y ns:people.marriage.type_of_union ns:m.04ztj .\nFILTER(NOT EXISTS {?y ns:people.marriage.from ?sk0} || \nEXISTS {?y ns:people.marriage.from ?sk1 . \nFILTER(xsd:datetime(?sk1) <= \"2015-08-10\"^^xsd:dateTime) })\nFILTER(NOT EXISTS {?y ns:people.marriage.to ?sk2} || \nEXISTS {?y ns:people.marriage.to ?sk3 . \nFILTER(xsd:datetime(?sk3) >= \"2015-08-10\"^^xsd:dateTime) })\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0k3pbm5",
            "EntityName": "Lamar Sally"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2440",
    "RawQuestion": "who the voice of peter griffin?",
    "ProcessedQuestion": "who the voice of peter griffin",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03n6jv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03n6jv ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n?y ns:tv.regular_tv_appearance.special_performance_type ns:m.02nsjvf .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.021yw7",
            "EntityName": "Seth MacFarlane"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2441",
    "RawQuestion": "what is the name of dawn french's first novel?",
    "ProcessedQuestion": "what is the name of dawn french 's first novel",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tzm9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tzm9 ns:book.author.works_written ?x .\n?x ns:book.written_work.copyright_date ?sk0 .\n}\nORDER BY xsd:datetime(?sk0)\nLIMIT 1\n",
        "Answers": []
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2446",
    "RawQuestion": "where does manny pacquiao live?",
    "ProcessedQuestion": "where does manny pacquiao live",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03pmbb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03pmbb ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01rfwg",
            "EntityName": "South Cotabato"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03fyt0",
            "EntityName": "Kiamba"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2449",
    "RawQuestion": "what four countries are in the united kingdom?",
    "ProcessedQuestion": "what four countries are in the united kingdom",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:base.aareas.schema.administrative_area.administrative_children ?x .\n?x ns:base.aareas.schema.administrative_area.administrative_area_type ns:m.0hzjlmp .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02jx1",
            "EntityName": "England"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05bcl",
            "EntityName": "Northern Ireland"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.06q1r",
            "EntityName": "Scotland"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0j5g9",
            "EntityName": "Wales"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2452",
    "RawQuestion": "where did the seminole native americans live?",
    "ProcessedQuestion": "where did the seminole native americans live",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0198dl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0198dl ns:people.ethnicity.geographic_distribution ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05mph",
            "EntityName": "Oklahoma"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2454",
    "RawQuestion": "what airlines fly into ontario international airport?",
    "ProcessedQuestion": "what airlines fly into ontario international airport",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l4_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l4_l ns:aviation.airport.hub_for ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01srh1",
            "EntityName": "Great Lakes Airlines"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.026tgjz",
            "EntityName": "West Air"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02ppptb",
            "EntityName": "UPS Airlines"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.06xnkm",
            "EntityName": "Ameriflight"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2477",
    "RawQuestion": "who is rob kardashian dating now 2012?",
    "ProcessedQuestion": "who is rob kardashian dating now 2012",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043n6dp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043n6dp ns:celebrities.celebrity.sexual_relationships ?y .\n?y ns:celebrities.romantic_relationship.celebrity ?x .\n?y ns:celebrities.romantic_relationship.relationship_type ns:m.02_7k44 .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0bxzjj9",
            "EntityName": "Rita Ora"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2484",
    "RawQuestion": "what all does stan kroenke own?",
    "ProcessedQuestion": "what all does stan kroenke own",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dg6f6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dg6f6 ns:sports.sports_team_owner.teams_owned ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01kkjq",
            "EntityName": "Colorado Rapids"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.06x76",
            "EntityName": "St. Louis Rams"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0jbqf",
            "EntityName": "Colorado Avalanche"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0jmdb",
            "EntityName": "Denver Nuggets"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0xbm",
            "EntityName": "Arsenal F.C."
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2485",
    "RawQuestion": "what countries does china border?",
    "ProcessedQuestion": "what countries does china border",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05w3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05w3 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.016zwt",
            "EntityName": "Nepal"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01crd5",
            "EntityName": "Vietnam"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03_3d",
            "EntityName": "Japan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03rk0",
            "EntityName": "India"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.047lj",
            "EntityName": "Kazakhstan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04hhv",
            "EntityName": "Laos"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04w8f",
            "EntityName": "Mongolia"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04xn_",
            "EntityName": "Myanmar"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05b7q",
            "EntityName": "North Korea"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05sb1",
            "EntityName": "Pakistan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.06bnz",
            "EntityName": "Russia"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.06f32",
            "EntityName": "Taiwan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07bxhl",
            "EntityName": "Bhutan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07dvs",
            "EntityName": "Tajikistan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0jdd",
            "EntityName": "Afghanistan"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0jt3tjf",
            "EntityName": "Kyrgyzstan"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2499",
    "RawQuestion": "who did plaxico burress sign with 2012?",
    "ProcessedQuestion": "who did plaxico burress sign with 2012",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.047j_j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.047j_j ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\nFILTER(NOT EXISTS {?y ns:sports.sports_team_roster.from ?sk0} || \nEXISTS {?y ns:sports.sports_team_roster.from ?sk1 . \nFILTER(xsd:datetime(?sk1) <= \"2012-12-31\"^^xsd:dateTime) })\nFILTER(NOT EXISTS {?y ns:sports.sports_team_roster.to ?sk2} || \nEXISTS {?y ns:sports.sports_team_roster.to ?sk3 . \nFILTER(xsd:datetime(?sk3) >= \"2012-01-01\"^^xsd:dateTime) })\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05tfm",
            "EntityName": "Pittsburgh Steelers"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2502",
    "RawQuestion": "what state did dwight d. eisenhower live in?",
    "ProcessedQuestion": "what state did dwight d. eisenhower live in",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.028rk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.028rk ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05tbn",
            "EntityName": "Pennsylvania"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07b_l",
            "EntityName": "Texas"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2505",
    "RawQuestion": "what is vanderbilt university mascot?",
    "ProcessedQuestion": "what is vanderbilt university mascot",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pq4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pq4w ns:education.educational_institution.mascot ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05k6hxh",
            "EntityName": "Vanderbilt University Mr. Commodore"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2512",
    "RawQuestion": "which island in greece?",
    "ProcessedQuestion": "which island in greece",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:base.aareas.schema.administrative_area.administrative_children ?x .\n?x ns:common.topic.notable_types ns:m.01xxv5b .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01s2g1",
            "EntityName": "Ionian Islands"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2513",
    "RawQuestion": "who has won the most fa cup?",
    "ProcessedQuestion": "who has won the most fa cup",
    "Parses": [
      {
        "Sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n    {\n      SELECT ?x (COUNT(?x) as ?count)\n      WHERE {\n          ns:m.02_p0 ns:sports.sports_award_type.winners ?y .\n          ?y ns:sports.sports_award.award_winner ?x .\n      }\n    }\n    {\n      SELECT (MAX(?count) AS ?maxCount)\n      WHERE {\n        SELECT ?x (COUNT(?x) as ?count) \n        WHERE {\n          ns:m.02_p0 ns:sports.sports_award_type.winners ?y .\n          ?y ns:sports.sports_award.award_winner ?x .\n        }\n      }\n    }\n    FILTER (?maxCount = ?count)\n}",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.050fh",
            "EntityName": "Manchester United F.C."
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0xbm",
            "EntityName": "Arsenal F.C."
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2525",
    "RawQuestion": "where did jerry spinelli go to college?",
    "ProcessedQuestion": "where did jerry spinelli go to college",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05djw1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05djw1 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01jt2w",
            "EntityName": "Temple University"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02hft3",
            "EntityName": "Gettysburg College"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09kvv",
            "EntityName": "Johns Hopkins University"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2526",
    "RawQuestion": "what is the zip code for cordova tn?",
    "ProcessedQuestion": "what is the zip code for cordova tn",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07j5_n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07j5_n ns:location.citytown.postal_codes ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03dxntr",
            "EntityName": "38018"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07nq_8m",
            "EntityName": "38088"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07nq_c7",
            "EntityName": "38016"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2542",
    "RawQuestion": "where does kaka live?",
    "ProcessedQuestion": "where does kaka live",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qv66)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04qv66 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\nFILTER(NOT EXISTS {?y ns:people.place_lived.end_date ?sk0} || \nEXISTS {?y ns:people.place_lived.end_date ?sk1 . \nFILTER(xsd:datetime(?sk1) >= \"2015-08-10\"^^xsd:dateTime) })\nFILTER(NOT EXISTS {?y ns:people.place_lived.start_date ?sk2} || \nEXISTS {?y ns:people.place_lived.start_date ?sk3 . \nFILTER(xsd:datetime(?sk3) <= \"2015-08-10\"^^xsd:dateTime) })\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01hy_",
            "EntityName": "Brasília"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05mxlfq",
            "EntityName": "Gama, Federal District"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2556",
    "RawQuestion": "what are some of the religions in australia?",
    "ProcessedQuestion": "what are some of the religions in australia",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.092bf5",
            "EntityName": "Buddhism"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0c8wxp",
            "EntityName": "Catholicism"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0flw86",
            "EntityName": "Islam"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0n2g",
            "EntityName": "Anglicanism"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2559",
    "RawQuestion": "what type of political system is headed by queen elizabeth ii?",
    "ProcessedQuestion": "what type of political system is headed by queen elizabeth ii",
    "Parses": [
      {
        "Sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  ns:m.0d1_f ns:government.politician.government_positions_held ?y1 .\t# Queen Elizabeth II\n  ?y1 ns:government.government_position_held.jurisdiction_of_office ?y2 .  # ?y2 = country\n  ?y2 ns:location.country.form_of_government ?x .\n}",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.014j8_",
            "EntityName": "Federation"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0163hx",
            "EntityName": "Consensus democracy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.018wl5",
            "EntityName": "Parliamentary system"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01fpfn",
            "EntityName": "Unitary state"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01q20",
            "EntityName": "Constitutional monarchy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.021zlr",
            "EntityName": "Non-partisan democracy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.026wp",
            "EntityName": "Democracy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04szc",
            "EntityName": "Monarchy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0drnm",
            "EntityName": "Representative democracy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0g3y9q",
            "EntityName": "Federal monarchy"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2562",
    "RawQuestion": "what city did obama grow up in?",
    "ProcessedQuestion": "what city did obama grow up in",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02hrh0_",
            "EntityName": "Honolulu"
          }
        ]
      }
    ]
  }
]