[
  {
    "QuestionId": "WebQTrn-248",
    "RawQuestion": "who started pixar?",
    "ProcessedQuestion": "who started pixar",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q127552 wdt:P112 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q93161",
            "EntityName": "Edwin Catmull"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2761378",
            "EntityName": "Alvy Ray Smith"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-277",
    "RawQuestion": "who did hera marry?",
    "ProcessedQuestion": "who did hera marry",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q38012 wdt:P26 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q34201",
            "EntityName": "Zeus"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-376",
    "RawQuestion": "who speaks farsi?",
    "ProcessedQuestion": "who speaks farsi",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { ?x wdt:P37 wd:Q9168; wdt:P31/wdt:P279* wd:Q6256. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q794",
            "EntityName": "Iran"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q249578",
            "EntityName": "Ghaznavid Empire"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q324470",
            "EntityName": "Qara Qoyunlu"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q555994",
            "EntityName": "Aq Qoyunlu"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q3708094",
            "EntityName": "Seljuk Empire"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q63134381",
            "EntityName": "Khwarezmian Empire"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q494354",
            "EntityName": "Kara-Khanid Khanate"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q577668",
            "EntityName": "Khanate of Bukhara"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q696241",
            "EntityName": "Khanate of Kokand"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q1634940",
            "EntityName": "Nakhichevan Khanate"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q1740542",
            "EntityName": "Quba Khanate"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2445341",
            "EntityName": "Maku Khanate"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q3459464",
            "EntityName": "Sarab Khanate"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q20583621",
            "EntityName": "Qazvin Khanate"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q21843649",
            "EntityName": "Khanate of Nishapur"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q27304761",
            "EntityName": "Asgardia"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-426",
    "RawQuestion": "who was louis riel?",
    "ProcessedQuestion": "who was louis riel",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q313691 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q82955",
            "EntityName": "politician"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-473",
    "RawQuestion": "who's kobe bryant?",
    "ProcessedQuestion": "who 's kobe bryant",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q25369 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q3665646",
            "EntityName": "basketball player"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q28389",
            "EntityName": "screenwriter"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-605",
    "RawQuestion": "who was tex beneke?",
    "ProcessedQuestion": "who was tex beneke",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q488352 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q158852",
            "EntityName": "conductor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q177220",
            "EntityName": "singer"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q806349",
            "EntityName": "bandleader"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q12800682",
            "EntityName": "saxophonist"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q15981151",
            "EntityName": "jazz musician"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-908",
    "RawQuestion": "who is james dean?",
    "ProcessedQuestion": "who is james dean",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q83359 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2259451",
            "EntityName": "stage actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q10349745",
            "EntityName": "racing automobile driver"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q10798782",
            "EntityName": "television actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q10800557",
            "EntityName": "film actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q33999",
            "EntityName": "actor"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-973",
    "RawQuestion": "who was dan cody?",
    "ProcessedQuestion": "who was dan cody",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q5213273 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q19204627",
            "EntityName": "American football player"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1013",
    "RawQuestion": "who is aidan davis?",
    "ProcessedQuestion": "who is aidan davis",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q4696678 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q5716684",
            "EntityName": "dancer"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1240",
    "RawQuestion": "where is mallorca?",
    "ProcessedQuestion": "where is mallorca",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q8828 wdt:P206 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q4918",
            "EntityName": "Mediterranean Sea"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1979",
    "RawQuestion": "who's betty white?",
    "ProcessedQuestion": "who 's betty white",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q373895 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q177220",
            "EntityName": "singer"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q245068",
            "EntityName": "comedian"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q482980",
            "EntityName": "author"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q578109",
            "EntityName": "television producer"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q947873",
            "EntityName": "television presenter"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2259451",
            "EntityName": "stage actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2405480",
            "EntityName": "voice actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q4610556",
            "EntityName": "model"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q10800557",
            "EntityName": "film actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q22662561",
            "EntityName": "game show host"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q44508716",
            "EntityName": "television personality"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1992",
    "RawQuestion": "who shot j lennon?",
    "ProcessedQuestion": "who shot j lennon",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q1203 wdt:P157 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q80462",
            "EntityName": "Mark David Chapman"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2428",
    "RawQuestion": "who is john garcia?",
    "ProcessedQuestion": "who is john garcia",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q918849 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q177220",
            "EntityName": "singer"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q753110",
            "EntityName": "songwriter"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2674",
    "RawQuestion": "where is usc from?",
    "ProcessedQuestion": "where is usc from",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q1024426 wdt:P131 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q38453",
            "EntityName": "Columbia"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2830",
    "RawQuestion": "where is madeira?",
    "ProcessedQuestion": "where is madeira",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q26253 wdt:P131 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q45",
            "EntityName": "Portugal"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2865",
    "RawQuestion": "where is bosnia?",
    "ProcessedQuestion": "where is bosnia",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q225 wdt:P30 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q46",
            "EntityName": "Europe"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-3094",
    "RawQuestion": "who is aidan quinn?",
    "ProcessedQuestion": "who is aidan quinn",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q403902 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2259451",
            "EntityName": "stage actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q3282637",
            "EntityName": "film producer"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q3387717",
            "EntityName": "theatrical director"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q10798782",
            "EntityName": "television actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q10800557",
            "EntityName": "film actor"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q33999",
            "EntityName": "actor"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-3143",
    "RawQuestion": "who owns audi 2011?",
    "ProcessedQuestion": "who owns audi 2011",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { ?y wdt:P355 wd:Q23317; wdt:P127 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q1529289",
            "EntityName": "Hannoversche Beteiligungsgesellschaft"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q1571175",
            "EntityName": "Qatar Investment Authority"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2104551",
            "EntityName": "Porsche Automobil Holding SE"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-3158",
    "RawQuestion": "what boudicca do?",
    "ProcessedQuestion": "what boudicca do",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q184634 wdt:P39 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q16511993",
            "EntityName": "queen"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-3586",
    "RawQuestion": "what nestle owns?",
    "ProcessedQuestion": "what nestle owns",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q160746 wdt:P355 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q301301",
            "EntityName": "Nespresso"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q2915350",
            "EntityName": "Osem"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q3338446",
            "EntityName": "Nestlé Waters"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q5064058",
            "EntityName": "Cereal Partners Worldwide"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q7273233",
            "EntityName": "Froneri"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q12042897",
            "EntityName": "Orion"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q16242798",
            "EntityName": "BlueTriton Brands"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q30338234",
            "EntityName": "Nestlé (United States)"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q30338236",
            "EntityName": "Nestlé (Canada)"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q48779154",
            "EntityName": "Nestlé Rossiya"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q48784564",
            "EntityName": "Nestlé Deutschland"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q58206677",
            "EntityName": "Nestlé Česko"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q104845552",
            "EntityName": "Nestlé India"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q110872981",
            "EntityName": "Nestle España"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-3612",
    "RawQuestion": "what is kate spade?",
    "ProcessedQuestion": "what is kate spade",
    "Parses": [
      {
        "Sparql": "SELECT DISTINCT ?x WHERE { wd:Q275094 wdt:P106 ?x. }",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q131524",
            "EntityName": "entrepreneur"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q3501317",
            "EntityName": "fashion designer"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "Q5436767",
            "EntityName": "fashion editor"
          }
        ]
      }
    ]
  }
]