[
  {
    "QuestionId": "WebQTrn-1266",
    "RawQuestion": "what theme songs did alan thicke wrote?",
    "ProcessedQuestion": "what theme songs did alan thicke wrote",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wd48)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wd48 ns:music.composer.compositions ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0_jvj26",
            "EntityName": "Facts of Life"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0_k73bx",
            "EntityName": "The Facts of Life"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0g54xzv",
            "EntityName": "Hockey Sock Rock"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0n9cmjv",
            "EntityName": "It Takes Diff'rent Strokes"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0zl7d7s",
            "EntityName": "Arnold & Willy (Diff'rent Strokes)"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0zwh63k",
            "EntityName": "Big Wheels"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1269",
    "RawQuestion": "who is liz lemon getting married to?",
    "ProcessedQuestion": "who is liz lemon getting married to",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02700g4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02700g4 ns:fictional_universe.fictional_character.married_to ?y .\n?y ns:fictional_universe.marriage_of_fictional_characters.spouses ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0272qdp",
            "EntityName": "Jack Donaghy"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1270",
    "RawQuestion": "who plays sarah wittle in jumanji?",
    "ProcessedQuestion": "who plays sarah wittle in jumanji",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09w353)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09w353 ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n?y ns:film.performance.character ns:m.0b3x5zt .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.015pvh",
            "EntityName": "Bonnie Hunt"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0ktdw_",
            "EntityName": "Laura Bell Bundy"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1272",
    "RawQuestion": "when is wimbledon tennis tournament?",
    "ProcessedQuestion": "when is wimbledon tennis tournament",
    "Parses": [
      {
        "Sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x \nWHERE {\n  ns:m.0mmmt ns:time.recurring_event.instances ?y . # The Championships, Wimbledon\n  ?y ns:time.event.start_date ?x . \n}\nORDER BY DESC(?x)\nLIMIT 1",
        "Answers": [
          {
            "AnswerType": "Value",
            "AnswerArgument": "2014-06-23",
            "EntityName": null
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-1277",
    "RawQuestion": "what language do you speak in iran?",
    "ProcessedQuestion": "what language do you speak in iran",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03shp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03shp ns:location.country.languages_spoken ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01bcw_",
            "EntityName": "Azerbaijani language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01m3f7",
            "EntityName": "Turkmen Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.032f6",
            "EntityName": "Persian Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03gg_5",
            "EntityName": "Qashqa'i Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03h871",
            "EntityName": "Luri language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.040blg",
            "EntityName": "Kumzari Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04w042",
            "EntityName": "Assyrian Neo-Aramaic Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07k3wd",
            "EntityName": "Khalaj, Turkic Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09hn84",
            "EntityName": "Mazanderani Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09k7n_",
            "EntityName": "Gilaki Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0b1g2",
            "EntityName": "Kurdish languages"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0bqk9s",
            "EntityName": "Talysh language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0fq4jq",
            "EntityName": "Afshar language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0fqmnr",
            "EntityName": "Khorasani Turkish Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0gl97",
            "EntityName": "Balochi language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0jzc",
            "EntityName": "Arabic Language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0swlx",
            "EntityName": "Pashto language"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0xrg",
            "EntityName": "Armenian Language"
          }
        ]
      }
    ]
  }
]