[
  {
    "QuestionId": "WebQTrn-100",
    "RawQuestion": "when will oscar pistorius compete?",
    "ProcessedQuestion": "when will oscar pistorius compete",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f1lfn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f1lfn ns:sports.pro_athlete.sports_played_professionally ?y .\n?y ns:sports.pro_sports_played.sport ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0bynt",
            "EntityName": "Track and field athletics"
          }
        ]
      }
    ],
    "Comment": "Information not available"
  },
  {
    "QuestionId": "WebQTrn-113",
    "RawQuestion": "what's the national sport of puerto rico?",
    "ProcessedQuestion": "what 's the national sport of puerto rico",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05r7t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05r7t ns:sports.sports_team_location.teams ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02p6lm8",
            "EntityName": "Capitanes de Arecibo"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03wcnxr",
            "EntityName": "Puerto Rico men's national volleyball team"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.047g442",
            "EntityName": "Puerto Rico women's national volleyball team"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04h5_c",
            "EntityName": "Puerto Rico national football team"
          }
        ]
      }
    ],
    "Comment": "Information not available"
  },
  {
    "QuestionId": "WebQTrn-126",
    "RawQuestion": "where to visit near bangkok?",
    "ProcessedQuestion": "where to visit near bangkok",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fn2g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fn2g ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01c1gj",
            "EntityName": "Wat Phra Kaew"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01d1vz",
            "EntityName": "Thonburi"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02816l2",
            "EntityName": "Bangkok Aquarium"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02jh89",
            "EntityName": "Grand Palace"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02pksll",
            "EntityName": "Samutprakarn Crocodile Farm and Zoo"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02vnrfw",
            "EntityName": "Bangkok National Museum"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02wwf3f",
            "EntityName": "Dusit Zoo"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03300t",
            "EntityName": "Khaosan Road"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03hlbr1",
            "EntityName": "Jim Thompson House"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03hp67d",
            "EntityName": "Ananta Samakhom Throne Hall"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03nr91r",
            "EntityName": "Siam Park City"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.03t0m6",
            "EntityName": "Democracy Monument"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.047sllp",
            "EntityName": "Safari World"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04q452",
            "EntityName": "Wat Pho"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05s69t",
            "EntityName": "Wat Arun"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.06nynb",
            "EntityName": "Wat Benchamabophit"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07_w5j",
            "EntityName": "Vimanmek Mansion"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07cz23",
            "EntityName": "Erawan Shrine"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07dj1f",
            "EntityName": "Wat Ratchanatdaram"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07qb9k",
            "EntityName": "Wat Suthat"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.080c8kl",
            "EntityName": "Golden Buddha"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09dnj5",
            "EntityName": "Chatuchak Park"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09qjqb",
            "EntityName": "Bangkok International Trade and Exhibition Centre"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09rxcz",
            "EntityName": "Lumphini Park"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0fp635",
            "EntityName": "Rajamangala Stadium"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0h6w70",
            "EntityName": "Wat Saket"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0vb3kfz",
            "EntityName": "Magic Land"
          }
        ]
      }
    ],
    "Comment": "Information not available"
  },
  {
    "QuestionId": "WebQTrn-143",
    "RawQuestion": "what did nick clegg study at university?",
    "ProcessedQuestion": "what did nick clegg study at university",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036547)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036547 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05r79",
            "EntityName": "Political philosophy"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.074n0",
            "EntityName": "Social anthropology"
          }
        ]
      }
    ],
    "Comment": "Information not available"
  },
  {
    "QuestionId": "WebQTrn-147",
    "RawQuestion": "what did rob kardashian get surgery for?",
    "ProcessedQuestion": "what did rob kardashian get surgery for",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043n6dp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043n6dp ns:medicine.notable_person_with_medical_condition.condition ?x .\n?x ns:medicine.disease.medical_specialties ns:m.0396b .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0jbx2",
            "EntityName": "Appendicitis"
          }
        ]
      }
    ],
    "Comment": "Information not available"
  },
  {
    "QuestionId": "WebQTrn-158",
    "RawQuestion": "what cities does ryanair fly to?",
    "ProcessedQuestion": "what cities does ryanair fly to",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01m_zd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01m_zd ns:aviation.airline.airports_served ?y .\n?y ns:aviation.airline_airport_presence.cities_served ?x .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.015g7",
            "EntityName": "Bratislava"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01f62",
            "EntityName": "Barcelona"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01jp4s",
            "EntityName": "Bergamo"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.029v4j",
            "EntityName": "Faro"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02cft",
            "EntityName": "Dublin"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.02hgz",
            "EntityName": "Derry"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.04jpl",
            "EntityName": "London"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05l64",
            "EntityName": "Oslo"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.06mxs",
            "EntityName": "Stockholm"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.09tlh",
            "EntityName": "Nottingham"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0clz7",
            "EntityName": "Cork"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0lvv8",
            "EntityName": "Carcassonne"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.0zc6",
            "EntityName": "Alicante"
          }
        ]
      }
    ],
    "Comment": "Information not available"
  }
]