[
  {
    "QuestionId": "WebQTrn-2572",
    "RawQuestion": "which states does the connecticut river flow through?",
    "ProcessedQuestion": "which states does the connecticut river flow through",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ldvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ldvs ns:location.location.partially_containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01x73",
            "EntityName": "Connecticut"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.059f4",
            "EntityName": "New Hampshire"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.05k7sb",
            "EntityName": "Massachusetts"
          },
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.07_f2",
            "EntityName": "Vermont"
          }
        ]
      }
    ]
  },
  {
    "QuestionId": "WebQTrn-2573",
    "RawQuestion": "what are the biggest cities in illinois?",
    "ProcessedQuestion": "what are the biggest cities in illinois",
    "Parses": [
      {
        "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03v0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03v0t ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n?x ns:topic_server.population_number ?sk0 .\n}\nORDER BY DESC(xsd:float(?sk0))\nLIMIT 1\n",
        "Answers": [
          {
            "AnswerType": "Entity",
            "AnswerArgument": "m.01_d4",
            "EntityName": "Chicago"
          }
        ]
      }
    ]
  }
]